; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v2)
             (pred_8 ?v4 ?v6)
             (pred_6 ?v3 ?v6)
             (pred_10 ?v8 ?v3 )
	     (pred_1 ?v3)
             (pred_11 ?v7)
             (pred_2 ?v4)
             (pred_4 ?v6)
             (pred_5 ?v3)
             (pred_3 ?v4)
             (pred_7 ?v3)
             (pred_9 ))



(:action op_4
:parameters (?v5 ?v1 ?v9 ?v10)
:precondition (and (pred_11 ?v5) (pred_11 ?v1) (pred_2 ?v9) (pred_4 ?v10)
          (pred_12 ?v5 ?v1) (pred_8 ?v9 ?v10)
                   (pred_6 ?v1 ?v10) (pred_1 ?v5) 
                   (pred_5 ?v1) (pred_3 ?v9))
:effect (and  (pred_7 ?v1) (not (pred_5 ?v1))))


(:action op_2
:parameters (?v5 ?v12)
:precondition (and (pred_11 ?v5) (pred_11 ?v12)
               (pred_1 ?v5) (pred_12 ?v5 ?v12) (pred_7 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v5))))

(:action op_5
:parameters (?v5 ?v9)
:precondition (and (pred_11 ?v5) (pred_2 ?v9) 
                  (pred_1 ?v5) (pred_10 ?v9 ?v5) (pred_9 ))
:effect (and (pred_3 ?v9)
   (not (pred_10 ?v9 ?v5)) (not (pred_9 ))))


(:action op_3
:parameters (?v5 ?v11 ?v13)
:precondition (and (pred_11 ?v5) (pred_2 ?v11) (pred_2 ?v13)
                  (pred_1 ?v5) (pred_3 ?v13) (pred_10 ?v11 ?v5))
:effect (and (pred_3 ?v11) (pred_10 ?v13 ?v5)
        (not (pred_3 ?v13)) (not (pred_10 ?v11 ?v5))))

(:action op_1
:parameters (?v5 ?v9)
:precondition (and (pred_11 ?v5) (pred_2 ?v9) 
                  (pred_1 ?v5) (pred_3 ?v9))
:effect (and (pred_9 ) (pred_10 ?v9 ?v5) (not (pred_3 ?v9)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_05 obj_04 obj_01 obj_06
    obj_02
    obj_03
    )

    (:init
       (pred_9)

       (pred_11 obj_05)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_11 obj_06)
       (pred_4 obj_02)
       (pred_2 obj_03)

       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_04 obj_06)
       (pred_12 obj_04 obj_05)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_06 obj_04)
       (pred_12 obj_06 obj_01)
       (pred_5 obj_01)
       (pred_6  obj_01 obj_02)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_7 obj_06)

       (pred_8  obj_03 obj_02)
       (pred_10 obj_03 obj_04)
       (pred_1 obj_04)
    )

    (:goal (and
       (pred_10 obj_03 obj_01)
    ))
(:constraints
  (always (not (pred_1 obj_05)))
)
)

; plan
1. (op_5 obj_04 obj_03)
   deleted: (pred_10 obj_03 obj_04) (pred_9)
   added: (pred_3 obj_03)
   goals met: 0 of 1
2. (op_2 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_01 obj_03 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_7 obj_01)
   goals met: 0 of 1
4. (op_2 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 0 of 1
5. (op_1 obj_01 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_9) (pred_10 obj_03 obj_01)
   goals met: 1 of 1
